DROP TABLE IF EXISTS `article`;

CREATE TABLE `article` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `cover` int(11) NOT NULL COMMENT '封面',
  `title` varchar(20) NOT NULL COMMENT '文章标题',
  `intr` varchar(255) NOT NULL COMMENT '简介',
  `conent` text NOT NULL COMMENT '文章内容',
  `created_at` int(11) DEFAULT NULL,
  `updated_at` int(11) DEFAULT NULL,
  `status` int(1) DEFAULT '1',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='文章表';

INSERT INTO `article` (`id`, `cover`, `title`, `intr`, `conent`, `created_at`, `updated_at`, `status`)
VALUES
	(1,5,'夏日搭配哪家强','你不会真的以为我要做个打扮指南吧','无论是谁，无论在哪里都能够简单的使用电子邮件，电子钱包，情报搜索之类的公共服务，一个与现实一样的假想都市被建成，并且被普及到世界的各个角落。主人公小矶健二是个性格内向的理科男生，暑假期间被自己仰慕的前辈筱原夏希拖去了她的老家长野县上田市。那里住着从室町时代开始一直存在的战国一家，阵内家。以夏希90岁的曾祖母为首，医生，渔民，消防员，水道管理员，电器店老板，警察，自卫队的军官，小学生直到婴儿，各行各业的亲戚都有。在这个热闹的田舍度过的暑假，健二看见了阵内家的活跃与和睦。一天夜里，健二受到了一封可疑的数学智力竞赛的邮件忍不住好奇心通宵将其解答。但是他却不知道这将是引起一场大灾难。',1533606233,1533606233,1),
	(2,6,'你喜欢大海，我爱过你','阚清子和纪凌尘不得不说的故事','无论是谁，无论在哪里都能够简单的使用电子邮件，电子钱包，情报搜索之类的公共服务，一个与现实一样的假想都市被建成，并且被普及到世界的各个角落。主人公小矶健二是个性格内向的理科男生，暑假期间被自己仰慕的前辈筱原夏希拖去了她的老家长野县上田市。那里住着从室町时代开始一直存在的战国一家，阵内家。以夏希90岁的曾祖母为首，医生，渔民，消防员，水道管理员，电器店老板，警察，自卫队的军官，小学生直到婴儿，各行各业的亲戚都有。在这个热闹的田舍度过的暑假，健二看见了阵内家的活跃与和睦。一天夜里，健二受到了一封可疑的数学智力竞赛的邮件忍不住好奇心通宵将其解答。但是他却不知道这将是引起一场大灾难。',1533606233,1533606233,1),
	(3,7,'幸福就是如此简单','能和心爱的人一起睡觉，是件幸福的事情；可是，打呼噜怎么办？','无论是谁，无论在哪里都能够简单的使用电子邮件，电子钱包，情报搜索之类的公共服务，一个与现实一样的假想都市被建成，并且被普及到世界的各个角落。主人公小矶健二是个性格内向的理科男生，暑假期间被自己仰慕的前辈筱原夏希拖去了她的老家长野县上田市。那里住着从室町时代开始一直存在的战国一家，阵内家。以夏希90岁的曾祖母为首，医生，渔民，消防员，水道管理员，电器店老板，警察，自卫队的军官，小学生直到婴儿，各行各业的亲戚都有。在这个热闹的田舍度过的暑假，健二看见了阵内家的活跃与和睦。一天夜里，健二受到了一封可疑的数学智力竞赛的邮件忍不住好奇心通宵将其解答。但是他却不知道这将是引起一场大灾难。',1533606233,1533606233,1),
	(4,8,'CBD天气简直是要热死人','烤炉模式的城，到黄昏，如同打翻的调色盘一般.','无论是谁，无论在哪里都能够简单的使用电子邮件，电子钱包，情报搜索之类的公共服务，一个与现实一样的假想都市被建成，并且被普及到世界的各个角落。主人公小矶健二是个性格内向的理科男生，暑假期间被自己仰慕的前辈筱原夏希拖去了她的老家长野县上田市。那里住着从室町时代开始一直存在的战国一家，阵内家。以夏希90岁的曾祖母为首，医生，渔民，消防员，水道管理员，电器店老板，警察，自卫队的军官，小学生直到婴儿，各行各业的亲戚都有。在这个热闹的田舍度过的暑假，健二看见了阵内家的活跃与和睦。一天夜里，健二受到了一封可疑的数学智力竞赛的邮件忍不住好奇心通宵将其解答。但是他却不知道这将是引起一场大灾难。',1533606233,1533606233,1),
	(5,9,'烟火里的尘埃','只有我，守着安静的沙漠，等待着花开','无论是谁，无论在哪里都能够简单的使用电子邮件，电子钱包，情报搜索之类的公共服务，一个与现实一样的假想都市被建成，并且被普及到世界的各个角落。主人公小矶健二是个性格内向的理科男生，暑假期间被自己仰慕的前辈筱原夏希拖去了她的老家长野县上田市。那里住着从室町时代开始一直存在的战国一家，阵内家。以夏希90岁的曾祖母为首，医生，渔民，消防员，水道管理员，电器店老板，警察，自卫队的军官，小学生直到婴儿，各行各业的亲戚都有。在这个热闹的田舍度过的暑假，健二看见了阵内家的活跃与和睦。一天夜里，健二受到了一封可疑的数学智力竞赛的邮件忍不住好奇心通宵将其解答。但是他却不知道这将是引起一场大灾难。',1533606233,1533606233,1);


DROP TABLE IF EXISTS `banners`;

CREATE TABLE `banners` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `title` varchar(20) NOT NULL COMMENT '轮播图标题',
  `link` varchar(255) DEFAULT NULL COMMENT '指向地址',
  `src` int(11) DEFAULT '1' COMMENT '图片指向地址',
  `status` int(1) DEFAULT '1',
  `created_at` int(11) DEFAULT NULL,
  `updated_at` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='轮播图表';

INSERT INTO `banners` (`id`, `title`, `link`, `src`, `status`, `created_at`, `updated_at`)
VALUES
	(1,'12321312321321','范德萨范德萨发生大发啊发范德萨发的萨法撒',1,1,1533606233,1533606233),
	(2,'我不曾爱过你，我自己骗自己','为你写的信，又被我丢进海里',2,1,1533606233,1533606233),
	(3,'我不曾爱过你，我自己骗自己','为你写的信，又被我丢进海里',3,1,1533606233,1533606233),
	(4,'我不曾爱过你，我自己骗自己','为你写的信，又被我丢进海里',4,1,1533606233,1533606233),
	(5,'我不曾爱过你，我自己骗自己','为你写的信，又被我丢进海里',10,1,1533606234,1533606233);


DROP TABLE IF EXISTS `picture`;

CREATE TABLE `picture` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `path` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '图片地址',
  `width` int(11) NOT NULL COMMENT '图片宽度',
  `height` int(11) NOT NULL COMMENT '图片高度',
  `md5` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT 'md5哈希验证字符',
  `sha1` varchar(50) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT 'sha1哈希验证字符',
  `created_at` int(11) NOT NULL COMMENT '创建时间',
  `updated_at` int(11) NOT NULL COMMENT '更新时间',
  `status` int(11) NOT NULL DEFAULT '1',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='图片信息表';

INSERT INTO `picture` (`id`, `path`, `width`, `height`, `md5`, `sha1`, `created_at`, `updated_at`, `status`)
VALUES
	(1,'/images/yuantiao.jpg',500,333,'','',1533606233,1533606233,1),
	(2,'/images/cbd.jpg',500,333,'','',1533606233,1533606233,1),
	(3,'/images/muwu.jpg',500,333,'','',1533606233,1533606233,1),
	(4,'/images/shuijiao.jpg',500,333,'','',1533606233,1533606233,1),
	(5,'/images/1.jpeg',500,333,'','',1533606233,1533606233,1),
	(6,'/images/2.jpeg',500,333,'','',1533606233,1533606233,1),
	(7,'/images/3.jpeg',500,333,'','',1533606233,1533606233,1),
	(8,'/images/4.jpeg',500,333,'','',1533606233,1533606233,1),
	(9,'/images/5.jpg',500,333,'','',1533606233,1533606233,1),
	(10,'/images/6.jpg',375,250,'','',1533606234,1533606233,1);